21-rails-route-helpers/rails-dogs/app/controllers/feeding_times_controller.rb

SELECT "feeding_times".* FROM "feeding_times" WHERE "feeding_times"."label" = ? LIMIT ?  [["label", "Morning"], ["LIMIT", 1]]
---
    def show
        @feeding_time = FeedingTime.find_by(label: params[:label])