survey-react-native/backend/app/controllers/dogs_controller.rb

  def index
    render({ json: Dog.all })
---
SELECT "dogs".* FROM "dogs"

  def update
    dog = Dog.find(params[:id])

    dog.update({
      likes: params[:likes],
    })
---
SELECT "dogs".* FROM "dogs" WHERE "dogs"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "dogs" SET "likes" = ? WHERE "dogs"."id" = ?  [["likes", 1], ["id", 4]]